
[
			{
				"id": 1,
				"name": "AR Virtual Home",
				"description": [
					"This project was my entry to Augmented Reality. I know that AR will have many important use cases in the future for society. Being able to understand at least how the it works will help keep me up to date with the latest technologies. I developed this app based off of the IKEA Place app that does something similar. I think that it is a good starting point for this type of project.", 
					"The user has the ability to browse items, rotate, scale, and place them on the grid area. The app can run on IOS and Android devices thanks to Unity's AR Foundation assets."
				],
				"tags": ["Unity","C#"],				
				"thumbnail": "/assets/media/ARHome/3.png",
				"youtube_ids": ["ne-2WAjQ0tk"],
				"images": [
					{"src": "/assets/media/ARHome/1.png", "text": "Before Using AR"}, 
					{"src": "/assets/media/ARHome/2.png", "text": "Rotating, Scaling, & Placing Objects"},
					{"src": "/assets/media/ARHome/3.png", "text": "Added Multiple Objects"},
					{"src": "/assets/media/ARHome/4.png", "text": "Walking Around"},
					{"src": "/assets/media/ARHome/5.png", "text": "Finished Room View"}
				],
				"links": [
					{"name": "Github", "url": "https://github.com/TravisLedo/ARWeHomeYet"},
					{"name": "Youtube", "url": "https://youtu.be/ne-2WAjQ0tk"}
				]
			},
			{
				"id": 2,
				"name": "Lidar Scanning & Rendering",
				"description": [
					"This project uses Lidar technology like those found in self driving cars to measure distances between itself and its surroundings. The data is sent to a Java program I developed and gets converted from spherical to cartesian points. The points get rendered together to make a 3D model of the environment.", 
					"The initial idea was to create some sort of 3D program in Java but I also wanted it to involve the real world. The first thing that came to mind were 3D printers. I decided to do the opposite by turning reality into a computer model."
				],
				"tags": ["Arduino","Java"],				
				"thumbnail": "/assets/media/LidarMapping/3.png",
				"youtube_ids": ["6YTCKRSWroE"],
				"images": [
					{"src": "/assets/media/LidarMapping/1.png", "text": "Lidar Sensor, Servos, Triopod, and Arduino"}, 
					{"src": "/assets/media/LidarMapping/2.png", "text": "Selecting Serial Port In Java Program"}, 
					{"src": "/assets/media/LidarMapping/3.png", "text": "Scanning Room"}, 
					{"src": "/assets/media/LidarMapping/4.png", "text": "Finished Mapping"}
				],
				"links": [
					{"name": "Github", "url": "https://github.com/TravisLedo/LidarScanRender"},
					{"name": "Hackster", "url": "https://www.hackster.io/TravisLedo/arduino-lidar-scanning-java-rendering-6b2124"},
					{"name": "Youtube", "url": "https://youtu.be/6YTCKRSWroE"}
				]
			},
			{
				"id": 3,
				"name": "Unity Adventure Game",
				"description": [
					"With a few years of experience in the Unity game engine, I wanted to challenge myself to develope a functional game. I was able to spend my summer break working on it. The goal was to create a first person game with magic spells. There should be at least one fully developed town where the player can roam around and talk to NPCs to accept quests such as dungeons.", 
					"Although there are lots of room for improvements, unfortunately the files were lost with my old laptop. Luckily though, I was able to finish the demo video."
				],				
				"tags": ["Unity","C#"],				
				"thumbnail": "/assets/media/UnityGame/3.png",
				"youtube_ids": ["kNrGQQwmmX4"],
				"images": [
					{"src": "/assets/media/UnityGame/1.png", "text": "Cinematic Camera View"}, 
					{"src": "/assets/media/UnityGame/2.png", "text": "Dungeon Traps"}, 
					{"src": "/assets/media/UnityGame/3.png", "text": "Using Skills on Enemies"}, 
					{"src": "/assets/media/UnityGame/4.png", "text": "Boss Fights"}
				],
				"links": [
					{"name": "Youtube", "url": "https://youtu.be/kNrGQQwmmX4"}
				]
			},
			{
				"id": 4,
				"name": "Android Poker App",
				"description": [
					"A fully functional Jacks or Better Video Poker game. It also has leaderboard features and players' scores are kept online. Meaning, they can log in on any device and continue their progress.", 
					"This was developed in Android Studio during a summer break and was the first project I ever worked on outside of classrooms. At the time I never used Android Studio before but really wanted to learn the ins and outs of developing and publishing a mobile app. I barely knew how to code but was determined to finish the app before my summer break was over, and succeeded in doing so.",
					"The app currently has more than 500 downloads and still active. I learned how to implement Google APIs such as Admob, Firebase Database, and Firebase Authentication."
				],		
				"tags": ["Android Studio","Java"],						
				"thumbnail": "/assets/media/PokerApp/1.png",
				"youtube_ids": [],
				"images": [
					{"src": "/assets/media/PokerApp/1.png", "text": "Gameplay"}, 
					{"src": "/assets/media/PokerApp/2.png", "text": "Leaderboards Hosted on Firebase"}, 
					{"src": "/assets/media/PokerApp/3.png", "text": "Game Over & Google Adsense"}, 
					{"src": "/assets/media/PokerApp/4.png", "text": "Profile View"}
				],
				"links": [
					
				]
			},
			{
				"id": 5,
				"name": "Sprite Split & Glue Tool",
				"description": [
					"Sprite Tool is an application designed with artists in mind. Game developers, animators, and etc. need a quick way to create sprite sheets or cut existing sheets into individual sprites. This is a free, intuitive, offline solution to assist them with these tasks. Users have the ability to preview the animations before finalizing their images. It is developed in C++ using QT Creator and works for both MacOS and Windows."
				],
				"tags": ["C++","Qt"],				
				"thumbnail": "/assets/media/SpriteTool/1.png",
				"youtube_ids": [],
				"images": [
					{"src": "/assets/media/SpriteTool/1.png", "text": "Glue Sprites Screen"}, 
					{"src": "/assets/media/SpriteTool/2.png", "text": "Split Sprites Screen"}, 
					{"src": "/assets/media/SpriteTool/3.gif", "text": "Glue Demo"}, 
					{"src": "/assets/media/SpriteTool/4.gif", "text": "Split Demo"}
				],
				"links": [
					{"name": "Github", "url": "https://github.com/TravisLedo/SpriteTool"}
				]
			}
			,{
				"id": 6,
				"name": "Media Player",
				"description": [
					"This is desktop application that plays audio and video files inside a playlist. Inspired by my favorite media player growing up called Winamp, I decided to make something similar but with a more modern design than what I remembered Winamp used to look like.", 
					"After taking my first Java class at a community college, I decided to build my first Java application. I did put it on hold though due to my lack of knowledge at the time. Eventually I came back to finish it during my Junior year when I had free time. This was my first experience with the JavaFX library. I did learn something similar in class called Swing but I heard it was outdated and wanted to learn the modern version of it."				],
				"tags": ["Java"],				
				"thumbnail": "/assets/media/MediaPlayer/3.png",
				"youtube_ids": [],
				"images": [
					{"src": "/assets/media/MediaPlayer/1.png", "text": "Empty Playlist"}, 
					{"src": "/assets/media/MediaPlayer/2.png", "text": "Adding media files"}, 
					{"src": "/assets/media/MediaPlayer/3.png", "text": "Playing a Video"}
				],
				"links": [
					{"name": "Github", "url": "https://github.com/TravisLedo/ImageSearchAndFilter"}
				]
			},
			{
				"id": 7,
				"name": "Brainwave Reader",
				"description": [
					"This project reads brainwave activities from electrodes and graphs them in real time inside of Java. This is possible by using a Neurosky TGAM1 chip that are also found in many commercial brainwave headsets. I wanted to make my own headset which saved me hundreds of dollars. Now with the graph program working, I have the experience to create other softwares for the headset in the future.", 
					"Since this is only a budget device, it can detect only two types of brain waves. How hard a person is concentrating and also how clear their mind is from a meditative state. With that we can do things such as turnning on and off a light with our minds. Very simple but still fun and amazing."
				],
				"tags": ["Java", "Arduino"],				
				"thumbnail": "/assets/media/BrainWave/1.png",
				"youtube_ids": [],
				"images": [
					{"src": "/assets/media/BrainWave/1.png", "text": "Arduino, TGAM1 Chip, & Electrodes"}, 
					{"src": "/assets/media/BrainWave/2.gif", "text": "Java Realtime Wave Graph"}
				],
				"links": [
					{"name": "Github", "url": "https://github.com/TravisLedo/BrainWaveProject"}
				]
			}

		
			
			
			
]